{
    "career_queries": {
      "hi": "Hello! How can I assist you today? Ask me about careers, skills, or resources.",
      "hello": "Hi there! I'm Edubot, your career counselor. What can I help you with?",
      "hey": "Hey! What career guidance are you looking for today?",
      "how are you": "I'm great, thank you! I'm here to help you with career guidance. What do you want to know?",
      "thank you": "You're welcome! Let me know if you have more questions.",
      "thanks": "Happy to help! Do you have any other questions?",
      "sorry": "No worries! Let’s get back to exploring your career options.",
      "bye": "Goodbye! Best of luck on your career journey!",
      "what can you do": "I can provide career guidance, suggest skills, and offer resources for your journey. Try asking me about careers in AI, law, or freelancing!",
      "who are you": "I'm Edubot, a chatbot here to help students like you with career advice and resources.",
      "who made you": "A talented developer created me to guide students in exploring their careers.",
      "tell me a joke": "Sure! Why don't scientists trust atoms? Because they make up everything!",
      "carrer": "Careers include engineering, IT, data science, and biology. Strong math, science, and problem-solving skills are key.",
      "arts": "Arts careers include graphic design, photography, writing, and music. Creativity and storytelling are essential.",
      "business": "Business careers span finance, marketing, and management. Sharpen your analytical and leadership skills.",
      "law": "Law involves analyzing legal cases and providing counsel. Study law, and develop research and debate skills.",
      "medical": "Medicine includes roles like doctor, nurse, and researcher. Focus on biology, chemistry, and empathy.",
      "psychology": "Psychology focuses on understanding behavior and mental health. Study counseling or neuroscience.",
      "ai and ml": "AI and ML involve creating intelligent systems. Learn Python, algorithms, and AI tools like TensorFlow.",
      "cybersecurity": "Cybersecurity focuses on protecting systems. Learn networking, cryptography, and tools like Wireshark.",
      "ui ux design": "UI/UX involves creating user-friendly interfaces. Master tools like Figma and understand user behavior.",
      "freelancing": "Freelancing lets you work independently. Platforms like Fiverr and Upwork are great for getting started.",
      "data science": "Data Science involves analyzing and visualizing data. Learn Python, R, SQL, and libraries like pandas.",
      "graphic design": "Graphic Design combines creativity with tools like Photoshop. Build a portfolio with small projects.",
      "engineering": "Engineering spans mechanical, electrical, and civil fields. Strong problem-solving skills are crucial.",
      "marketing": "Marketing includes advertising, social media, and branding. Study consumer behavior and strategies.",
      "scholarships": "Search platforms like Scholarships.com, or consult your institution's financial aid office.",
      "online courses": "Udemy, Coursera, and edX offer a variety of online courses to enhance your skills.",
      "how to network": "Networking involves building relationships. Attend events, join LinkedIn, and stay active in communities.",
      "interview tips": "Prepare by researching the company, practicing questions, and showing confidence. Stay calm and positive!",
      "remote jobs": "Look for remote work opportunities on Remote.co, FlexJobs, and We Work Remotely.",
      "motivation": "Stay focused on your goals. Every small step counts, and perseverance leads to success!",
      "what is your favorite career": "I admire careers that involve helping others, like teaching, medicine, or counseling. What about you?",
      "what is the best career": "The best career aligns with your passion, skills, and values. Let me know your interests!",
      "what should I do after high school": "Explore your interests, consider college or vocational training, and take up internships to gain exposure.",
      "what should I study": "Choose subjects that align with your strengths and interests. For tech, study computer science. For design, focus on art and tools.",
      "how to find internships": "Check platforms like Internshala, LinkedIn, and Indeed. Networking can also help you find opportunities.",
      "how to start a startup": "Research your idea, create a business plan, and start small. Use resources like Y Combinator Startup School.",
      "how to improve communication skills": "Practice speaking clearly, listen actively, and participate in group discussions. Reading books and watching TED Talks can help too.",
      "how to write a resume": "Highlight your skills, education, and experience. Keep it concise, tailored to the job, and free of errors.",
      "how to manage time": "Prioritize tasks, use tools like to-do lists or apps, and avoid procrastination by breaking tasks into smaller steps.",
      "best programming languages": "For web development, learn JavaScript. For AI, Python. For app development, Swift or Kotlin.",
      "how to learn coding": "Start with basics on platforms like Codecademy or freeCodeCamp. Build projects to practice.",
      "what is freelancing": "Freelancing is offering services independently. It’s flexible and requires skills like communication and time management.",
      "how to handle failure": "Failures are steps to success. Reflect on what went wrong, learn from it, and keep moving forward.",
      "top careers of the future": "Careers in AI, data science, renewable energy, and health tech are booming. Adapt and upskill!",
      "how to prepare for exams": "Organize your study schedule, take regular breaks, and focus on understanding concepts rather than rote learning.",
      "how to overcome procrastination": "Set clear goals, break tasks into smaller steps, and create a distraction-free environment.",
      "what is success": "Success is achieving your goals and finding fulfillment in what you do. It’s a personal journey!"
    }
  }
  